routes/web.php

select * from "posts"
---
});

Route::get('/posts', function () {
    return view('posts', ['title' => 'Blog', 'posts' =>
    // memanggil scopes filter ada didalam models
    Post::filter(request(['search', 'category', 'author']))->latest()->simplePaginate(9)->withQueryString()]);

select * from "posts" where "posts"."author_id" = 6 and "posts"."author_id" is not null
select * from "posts" where "posts"."category_id" = 1 and "posts"."category_id" is not null
---
    return view('post', ['title' => 'Single Post', 'post' => $post]);
});

Route::get('/authors/{user:username}', function (User $user) {
    // Lazy loading
    $posts = $user->posts->load('category', 'author');

    return view('posts', ['title' => count($posts) . ' Article by ' .
        $user->name, 'posts' => $posts]);
});

Route::get('/categories/{category:slug}', function (Category $category) {
    // Lazy loading
    $posts = $category->posts->load('category', 'author');

    return view('posts', ['title' => 'Articles in: ' .
        $category->name, 'posts' => $posts]);
});